## **Experiment 9**

#### **Name : Smayan Kulkarni, SAP ID : 60009230142 , Roll Number : D100, Division : D2-2**

In [1]:
import pandas as pd
import numpy as np



1. Create a Pandas Series from a list of 10 random integers and calculate its mean.

In [2]:
random_integers = np.random.randint(1, 100, 10)
series = pd.Series(random_integers)
mean_value = series.mean()
print("Mean:", mean_value)

Mean: 39.6

2. Create a DataFrame from a dictionary with columns 'Name', 'Age', and 'City'.

In [3]:
data = {
    'Name': ['Smayan', 'Sian', 'Varun'],
    'Age': [24, 36, 22],
    'City': ['New York', 'Mumbai', 'Chicago']
}
df = pd.DataFrame(data)
df

     Name  Age      City
0  Smayan   24  New York
1    Sian   36    Mumbai
2   Varun   22   Chicago

3. Access the first 5 elements of a Pandas Series using slicing.

In [4]:
first_five = series[:5]
print(first_five)

0    35
1    60
2    62
3    72
4    28
dtype: int64

4. Add a new column 'Score' to a DataFrame with values [85, 90, 78, 92].

In [5]:
df['Score'] = [85, 90, 78]  
df

     Name  Age      City  Score
0  Smayan   24  New York     85
1    Sian   36    Mumbai     90
2   Varun   22   Chicago     78

5. Use .iloc to access the first row of a DataFrame.

In [6]:
first_row = df.iloc[0]
print(first_row)

Name       Smayan
Age            24
City     New York
Score          85
Name: 0, dtype: object

6. Use .loc to select the rows where 'Age' is 25 in a DataFrame.

In [7]:
age_25 = df.loc[df['Age'] == 25]

(age_25)

Empty DataFrame
Columns: [Name, Age, City, Score]
Index: []

7. Create a Series with a custom index ['a', 'b', 'c'] and access the value at index 'b'.

In [8]:
cust_series = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
value_b = cust_series['b']
print(value_b)

20


8. Calculate the standard deviation of a Series containing numerical values.

In [9]:
std_dev = np.std(series)
print("Standard Deviation:", std_dev)

Standard Deviation: 21.100710888498522

9. Create a DataFrame and drop the 'City' column using the drop method.

In [10]:
df_dropped = df.drop('City', axis=1)
df_dropped

     Name  Age  Score
0  Smayan   24     85
1    Sian   36     90
2   Varun   22     78

10. Filter a DataFrame to show rows where 'Age' is greater than 30 using boolean indexing.

In [11]:
age_greater_30 = df[df['Age'] > 30]
print(age_greater_30)

   Name  Age    City  Score
1  Sian   36  Mumbai     90

11. Apply a lambda function to a DataFrame column to square the values.

In [12]:
df['Score'] = df['Score'].apply(lambda x: x**2)
df

     Name  Age      City  Score
0  Smayan   24  New York   7225
1    Sian   36    Mumbai   8100
2   Varun   22   Chicago   6084


12. Use .iloc to select the last 3 rows of a DataFrame.

In [13]:
last_three_rows = df.iloc[-3:]
print(last_three_rows)

     Name  Age      City  Score
0  Smayan   24  New York   7225
1    Sian   36    Mumbai   8100
2   Varun   22   Chicago   6084

13. Rename the 'Name' column to 'FullName' in a DataFrame and display the DataFrame.

In [14]:
df.rename(columns={'Name': 'FullName'}, inplace=True)
print(df)

  FullName  Age      City  Score
0   Smayan   24  New York   7225
1     Sian   36    Mumbai   8100
2    Varun   22   Chicago   6084


14. Use .loc to select rows based on a condition and specific columns.

In [15]:
specific_columns = df.loc[df['Age'] > 25, ['FullName', 'Age']]
print(specific_columns)

  FullName  Age
1     Sian   36

15. Create a DataFrame from a list of lists with columns ['A', 'B', 'C'] and calculate the mean of each column.

In [16]:
list_of_lists = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
df_lists = pd.DataFrame(list_of_lists, columns=['A', 'B', 'C'])
means = df_lists.mean()
print(means)

A    4.0
B    5.0
C    6.0
dtype: float64

16. Load the Titanic dataset from kaggle into a DataFrame and display the first 5 rows.

In [18]:
titanic_df = pd.read_csv("train.csv")
titanic_df.iloc[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

17. Calculate the correlation matrix of a DataFrame with numerical columns from the Wine Quality dataset .

In [ ]:
wine_df = pd.read_csv('WineQT.csv')
corrmatrix = wine_df.corr()
corrmatrix

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality,Id
fixed acidity,1.000000,-0.250728,0.673157,0.171831,0.107889,-0.164831,-0.110628,0.681501,-0.685163,0.174592,-0.075055,0.121970,-0.275826
volatile acidity,-0.250728,1.000000,-0.544187,-0.005751,0.056336,-0.001962,0.077748,0.016512,0.221492,-0.276079,-0.203909,-0.407394,-0.007892
citric acid,0.673157,-0.544187,1.000000,0.175815,0.245312,-0.057589,0.036871,0.375243,-0.546339,0.331232,0.106250,0.240821,-0.139011
residual sugar,0.171831,-0.005751,0.175815,1.000000,0.070863,0.165339,0.190790,0.380147,-0.116959,0.017475,0.058421,0.022002,-0.046344
chlorides,0.107889,0.056336,0.245312,0.070863,1.000000,0.015280,0.048163,0.208901,-0.277759,0.374784,-0.229917,-0.124085,-0.088099
free sulfur dioxide,-0.164831,-0.001962,-0.057589,0.165339,0.015280,1.000000,0.661093,-0.054150,0.072804,0.034445,-0.047095,-0.063260,0.095268
total sulfur dioxide,-0.110628,0.077748,0.036871,0.190790,0.048163,0.661093,1.000000,0.050175,-0.059126,0.026894,-0.188165,-0.183339,-0.107389
density,0.681501,0.016512,0.375243,0.380147,0.208901,-0.054150,0.050175,1.000000,-0.352775,0.143139,-0.494727,-0.175208,-0.363926
pH,-0.685163,0.221492,-0.546339,-0.116959,-0.277759,0.072804,-0.059126,-0.352775,1.000000,-0.185499,0.225322,-0.052453,0.132904
sulphates,0.174592,-0.276079,0.331232,0.017475,0.374784,0.034445,0.026894,0.143139,-0.185499,1.000000,0.094421,0.257710,-0.103954
alcohol,-0.075055,-0.203909,0.106250,0.058421,-0.229917,-0.047095,-0.188165,-0.494727,0.225322,0.094421,1.000000,0.484866,0.238087
quality,0.121970,-0.407394,0.240821,0.022002,-0.124085,-0.063260,-0.183339,-0.175208,-0.052453,0.257710,0.484866,1.000000,0.069708
Id,-0.275826,-0.007892,-0.139011,-0.046344,-0.088099,0.095268,-0.107389,-0.363926,0.132904,-0.103954,0.238087,0.069708,1.000000

18. Create a DataFrame with a 'Date' column and set it as the index, then resample the data by month.

In [20]:
date_rng = pd.date_range(start='2023-01-01', end='2023-12-31', freq='D')

df_date = pd.DataFrame(date_rng, columns=['Date'])
df_date['Value'] = np.random.randint(0, 100, size=(len(date_rng)))

df_date.set_index('Date', inplace=True)

monthly_resampled = df_date.resample('M').sum()

print(monthly_resampled)

            Value
Date
2023-01-31   1401
2023-02-28   1374
2023-03-31   1585
2023-04-30   1576
2023-05-31   1364
2023-06-30   1480
2023-07-31   1183
2023-08-31   1427
2023-09-30   1505
2023-10-31   1125
2023-11-30   1370
2023-12-31   1567

/tmp/ipykernel_4030/771239444.py:8: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  monthly_resampled = df_date.resample('M').sum()